"""

Домашнее задание №1

Цикл for: Продажи товаров

* Дан список словарей с данными по колличеству проданных телефонов
  [
    {'product': 'iPhone 12', 'items_sold': [363, 500, 224, 358, 480, 476, 470, 216, 270, 388, 312, 186]}, 
    {'product': 'Xiaomi Mi11', 'items_sold': [317, 267, 290, 431, 211, 354, 276, 526, 141, 453, 510, 316]},
    {'product': 'Samsung Galaxy 21', 'items_sold': [343, 390, 238, 437, 214, 494, 441, 518, 212, 288, 272, 247]},
  ]
* Посчитать и вывести суммарное количество продаж для каждого товара
* Посчитать и вывести среднее количество продаж для каждого товара
* Посчитать и вывести суммарное количество продаж всех товаров
* Посчитать и вывести среднее количество продаж всех товаров
"""
def main():
  
  sold_i12 =  [363, 500, 224, 358, 480, 476, 470, 216, 270, 388, 312, 186]
  print (('Всего продано iPhone 12:'), (sum(sold_i12)))
  print (('Средне арифм. проданных iPhone 12: '), (int (statistics.mean (sold_i12))))
  sold_mi11 = [317, 267, 290, 431, 211, 354, 276, 526, 141, 453, 510, 316]
  print (('Всего продано Xiaomi Mi11:'), (sum(sold_mi11)))
  print (('Средне арифм. проданных Xiaomi Mi11: '), (int (statistics.mean (sold_mi11))))
  sold_g21 = [343, 390, 238, 437, 214, 494, 441, 518, 212, 288, 272, 247]
  print (('Всего продано Samsung Galaxy 21:'), (sum(sold_g21)))
  print (('Средне арифм. проданных Samsung Galaxy 21: '), (int (statistics.mean (sold_g21))))


  

    
if __name__ == "__main__":
    main()

