"""

Домашнее задание №1

Условный оператор: Сравнение строк

* Написать функцию, которая принимает на вход две строки
* Проверить, является ли то, что передано функции, строками. 
  Если нет - вернуть 0
* Если строки одинаковые, вернуть 1
* Если строки разные и первая длиннее, вернуть 2
* Если строки разные и вторая строка 'learn', возвращает 3
* Вызвать функцию несколько раз, передавая ей разные праметры 
  и выводя на экран результаты

"""




def strok (a,b):
   a = int(input('Введите слово 1'))
   b = int(input('Введите слово 2'))
   
   for i in a
   if i in b
   else return c
   if a = b [1]
   if a > b [2]
   if b 